tutorials/immersedBoundary/porousBumpChannelBodyFitted/Allrun
#!/bin/sh
# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

# Get application name
application="porousSimpleFoam"

mkdir 0
cp 0_org/* 0

runApplication blockMesh
runApplication setSet -batch setSet.batch
runApplication setsToZones
runApplication potentialFoam
runApplication $application
